export const EMPLOYEE_CONST = {
    title: {
        '1': '代表取締役社長',
        '2': '専務取締役',
        '3': '取締役',
        '4': '執行役員',
        '5': '監査役',
        '6': '事業部長',
        '7': '部長',
        '8': 'GL',
        '9': '一般社員',
        '10': '派遣社員',
        '11': '業務委託',
        '12': '契約・嘱託',
        '13': 'アルバイト・パート'
    },
    recruitmentClass: {
        '1': '新卒',
        '2': '中途'
    },
    gender: {
        '1': '男性',
        '2': '女性'
    },
    leaveFlg: {
        '0': '',
        '1': '休職中'
    },
    del_flg: {
        '0': '',
        '1': '削除'
    },
    grade: [
        'B1',
        'B2',
        'A1',
        'A2',
        'S',
        'T',
    ],
    dept: [
        'AID本部AI開発',
        'BI第1本部ビジネスサービス部',
        'BI第1本部医薬',
        'BI第2本部ソリューション開発部',
        'BI第2本部健康情報サービス部',
        'BI第2本部旅行BI部',
        'RT本部リサーチシステム一部',
        'RT本部リサーチシステム二部'
    ]
};

export const TABLE_HEADER = {
    EMPLOYEES_INDEX : [
        "",
        "社員番号",
        "氏名",
        "部署",
        "入社年数",
        "役職",
        "等級",
        "採用区分",
        "性別",
        "生年月日",
    ],
    EMPLOYEES_INFO1 : [
        "資格ID",
        "資格名",
        "資格概要"
    ],
    EMPLOYEES_INFO2 : [
        "研修名",
        "受講日",
        "研修後満足度"
    ]
}
