export const TRAINING_CONST ={
    trainingClass: {
        '1': 'レベル別研修',
        '2': '8つの人材像',
        '3': '階層別研修',
        '4': '経営ユニバーシティ'
    },
    skillClass: {
        '1': 'テクニカルスキル',
        '2': 'コンセプチュアルスキル',
        '3': 'ヒューマンスキル'
    },
    ITLevel: {
        '0': '新入社員',
        '1': '1',
        '2': '2',
        '3': '3',
        '4': '4',
        '5': '5'
    },
    newFlg: {
        '1': '既存',
        '2': '新規'
    },
    selectionFlg: {
        '1': '選抜',
        '2': '募集',
        '3': '一部募集'
    },
    title: {
        '1': '代表取締役社長',
        '2': '専務取締役',
        '3': '取締役',
        '4': '執行役員',
        '5': '監査役',
        '6': '事業部長',
        '7': '部長',
        '8': 'GL',
        '9': '一般社員',
        '10': '派遣社員',
        '11': '業務委託',
        '12': '契約・嘱託',
        '13': 'アルバイト・パート'
    },
    attendance_state: {
        '1': '一般参加',
        '2': '運営参加'
    },
    recruitmentClass: {
        '1': '新卒',
        '2': '中途'
    }
};

export const TABLE_HEADER ={

    TRAININGS_INDEX: [
        "研修ID",
        "研修名",
        "研修分類",
        "スキル分類",
        "IT人材レベル",
        "募集人数",
        "参加人数",
        "既存/新規",
        "選抜/募集",
        "研修開始日",
        "研修終了日",
    ],
    TRAININGS_INFO: [
        "",
        "社員番号",
        "氏名",
        "部署",
        "役職",
        "等級",
        "採用区分",
        "入社年度",
        "受講状況",
        "受講満足度"
    ]
}